// import 'package:flutter/cupertino.dart';
// import 'package:flutter/material.dart';
// import 'package:hymn/screens/hymn_pdf.dart';
// import 'package:hymn/themes/theme_provider.dart';
// import 'package:provider/provider.dart';

// class HomePage extends StatefulWidget {
//   const HomePage({super.key});

//   @override
//   State<HomePage> createState() => _HomePageState();
// }

// class _HomePageState extends State<HomePage> {
//   final TextEditingController _searchController = TextEditingController();

//   bool isHovered = false;
//   bool isTapped = false;

//   Color defaultColor = Colors.blueGrey;
//   Color hoveredColor = Colors.blue;
//   Color tappedColor = Colors.green;
//   final Map<String, String> hymns = {
//     "၁": "ခမည်းတော်ကမ္ဘာ",
//     "၂": "ဘုရားသခင်အားဘုန်းကြီးစေသော",
//     "၃": "ထက်ဘုံတော်မှကောင်းကင်သားများ",
//     "၄": "ဘုရားသခင်မေတ္တာ",
//     "၅": "အပ္ပမေယျမေတ္တာတော်",
//     "၆": "ထာဝရဘုရားသည်မေတ္တောတော်ရှင်",
//     "၇": "အားကြီးသောခံတပ်",
//     "၈": "မင်္ဂလာရှိနာမတော်",
//     "၉": "ကြီးမားလှသစ္စာ",
//     "၁၀": "ဘယ်မျှကြီးမြတ်တော်မူသည်",
//     "၁၁": "ယေရှု၏အံ့ဩဖွယ်ကျေးဇူးတော်",
//     "၁၂": "ကတိတော်၌တည်",
//     "၁၃": "အံ့ဘွယ်ကျေးဇူးတော်",
//     "၁၄": "ကရာနီမှာ",
//     "၁၅": "ကားတိုင်မှာ",
//     "၁၆": "ကားတိုင်လမ်း",
//     "၁၇": "ကယ်တင်ခြင်းစိတ်ချ၍ချီးမွမ်း",
//     "၁၈": "ကယ်တင်ပိုင်ရှင်ဝင်ပါစေ",
//     "၁၉": "ကယ်တင်ရှင်သိုးထိန်းလမ်းပြ",
//     "၂၀": "ကျွန်ုပ်ရွေးနှုတ်သက်ရှင်ပြီ",
//     "၂၁": "ဘုန်းတော်ရှင် ဘုရင်",
//     "၂၂": "လောကဝမ်းမြောက်စေ",
//     "၂၃": "ကိုးစား၍နားထောင်",
//     "၂၄": "ကောင်းကင်ခေါင်းလောင်း",
//     "၂၅": "ကြည်လင်လှစွာသန်းခေါင်ယံ",
//     "၂၆": "ကောင်းချီးရေတွက်",
//     "၂၇": "ကရာနီကုန်းပေါ်သွန်း",
//     "၂၈": "မုန်တိုင်းလွန်သွားသည့်တိုင်",
//     "၂၉": "မုန်တိုင်းထန်ယော်ဒန်ကမ်း ၁",
//     "၃၀": "မုန်တိုင်းထန်ယော်ဒန်ကမ်း ၂",
//     "၃၁": "ချီးမွမ်းကြပါ၏",
//     "၃၂": "ကိုယ်တော်ကိုချီးမွမ်းကြလော့",
//     "၃၃": "ကောင်းမြတ်သခင်",
//     "၃၄": "အကောင်းဆုံးမိတ်ဆွေ",
//     "၃၅": "ဆုတောင်းရန်နာရီ",
//     "၃၆": "ကောင်းပေသည်",
//     "၃၇": "ကိုယ်တော်ကိုချီးမွမ်းမည်",
//     "၃၈": "ကိုယ်တော်ကိုသာ၍ချစ်ကြောင်းသိသည်",
//     "၃၉": "ကိုယ်တော်ကိုသာ၍ချစ်ခြင်း",
//     "၄၀": "ကိုယ်တော်ကိုသိလိမ့်မည်",
//     "၄၁": "ဆာငတ်မွတ်သိပ်မှုပျောက်စေရန်",
//     "၄၂": "ကိုယ်တော်အလိုအတိုင်း",
//     "၄၃": "ကိုယ်တော်၌သာ ကွယ်ကာနေပါ",
//     "၄၄": "ကိုယ်တော်အားအကောင်းဆုံးကိုပေးပါ",
//     "၄၅": "ကိုယ်တော်ကိုလိုပါ၏",
//     "၄၆": "ကိုယ်တော်၌ဝမ်းမြောက်လော့",
//     "၄၇": "ကိုယ်တော်နှင့်နီးစေပါ",
//     "၄၈": "ကိုယ်တော်ထံမှသတင်းရှိ",
//     "၄၉": "စောင့်ထိန်းတော်မူလိမ့်မည်",
//     "၅၀": "ကိုယ်တော်သက်ရှင်",
//     "၅၁": "ကိုယ်တော်ကျိန်းရန်မရှိ",
//     "၅၂": "ကိုယ်တော်နှင့်အတူရှိပါစေသော",
//     "၅၃": "နိုင်ငံတော်တည်ခြင်း",
//     "၅၄": "ကိုယ်တော်လိုချိန်",
//     "၅၅": "စိတ်ငယ်ဝမ်းနည်းဒုက္ခကြီးထဲမှာ",
//     "၅၆": "ကောက်လိုင်းများဆောင်ယူခြင်း",
//     "၅၇": "ညအမှောင်ရောက်လုပြီ",
//     "၅၈": "ညဉ့်ဦးအချိန်",
//     "၅၉": "ကျမ်းစာမြတ်ပေးပါ",
//     "၆၀": "ကောင်းကင်မြေကြီးသခင်",
//     "၆၁": "ဂုဏ်တော်ချီးမွမ်း",
//     "၆၂": "ကျွန်ုပ်စိတ်တံခါးဖွင့်ပေးပါ",
//     "၆၃": "နေဝင်နောက်ကွယ်",
//     "၆၄": "ကိုယ်တော်ဘက်၌မည်သူရှိသနည်း",
//     "၆၅": "သိုးထိန်းများစောင့်နေစဉ်",
//     "၆၆": "ကျွန်ုပ်မိတ်ဆွေတွေ့ပြီ",
//     "၆၇": "ခံတပ်ထိန်းထား",
//     "၆၈": "ကျွန်ုပ်သူ့ကိုသိ၏",
//     "၆၉": "ပြန်လာပြီသခင်",
//     "၇၀": "အဝေးခရီးတလျှောက်",
//     "၇၁": "သက်စမ်းရေသိုလာ",
//     "၇၂": "ကြီးသောနေ့ရောက်မည်",
//     "၇၃": "ကြည့်မြင်၍ သက်ရှင်လေ",
//     "၇၄": "ခရစ်တော်ကိုပြောပါ",
//     "၇၅": "ခရစ်တော်ထမြောက်ပြီ",
//     "၇၆": "ခရစ်တော်၌အရှေ့အနောက်မရှိ",
//     "၇၇": "ဘဏ္ဍာတော်",
//     "၇၈": "ခရစ်ယာန်စစ်သည်တိုချီ",
//     "၇၉": "မင်္ဂလာမိုးသွန်းလောင်းရွာမည်",
//     "၈၀": "ငါ၏နာမည်ရေးလျက်ရှိသလား",
//     "၈၁": "ရှိသည်အတိုင်းယူပါ",
//     "၈၂": "ထက်ရပ်မှာ",
//     "၈၃": "အသက်မှုန့်ပေးပါဘုရား",
//     "၈၄": "ခရစ်ယာန်ရောက်ရာ",
//     "၈၅": "ဂရုဏာထာဝစဉ်တည်",
//     "၈၆": "သက်စမ်းရေလမ်း",
//     "၈၇": "ရှေးခါဒါဝိဒ်မင်းမြိုတော်မှာ",
//     "၈၈": "ငါ့ဝိညာဉ်၌အလင်းရှိ",
//     "၈၉": "ယနေ့ခရစ်တော်ထမြောက်ပြီ",
//     "၉၀": "ထိုနေရာ၌ကြယ်များရှိဦးမည်လော",
//     "၉၁": "မျှော်လင့်ခြင်းတည်ရာကျောက်",
//     "၉၂": "ယေရှုကိုယုံကြည်ခြင်း",
//     "၉၃": "ယေရှုထံလာပြီ",
//     "၉၄": "စစ်တိုက်သံကြွေးကြော်",
//     "၉၅": "ယေရှုဖိုထကြ",
//     "၉၆": "နာမည်ခေါ်သောခါ",
//     "၉၇": "ပြည့်စုံသောငြိမ်သက်ခြင်း",
//     "၉၈": "ဆုတောင်းရန်အချိန်ကျပြီ",
//     "၉၉": "ယေရှုဖိုနေရာအခန်းရှိသလား",
//     "၁၀၀": "ဇိအုန်တောင်သိုချီတက်စို",
//     "၁၀၁": "သူငယ်တော်ကား",
//     "၁၀၂": "ယေရှုသာလျှင်အလိုဖြည့်နိင်",
//     "၁၀၃": "ယေရှုအကြောင်းပို၍သိလို",
//     "၁၀၄": "တရားနေမင်း",
//     "၁၀၅": "ယေရှုအသွေးတော်",
//     "၁၀၆": "ယုံကြည်ခြင်းပငှာနာ",
//     "၁၀၇": "တန်ခိုးရှင်အားချီးမ္မမ်းကြလော့",
//     "၁၀၈": "နာမတော်ဘုန်းကြီးစေသား",
//     "၁၀၉": "ယုံကြည်ပါ",
//     "၁၁၀": "နောက်တော်သို့လိုက်ခြင်း",
//     "၁၁၁": "ကျွန်ုပ်ယုံပြီ",
//     "၁၁၂": "ကောင်းကင်သားကြွေးကြော်သံနားထောင်",
//     "၁၁၃": "ထိန်းမြားမင်္ဂလာသီချင်း",
//     "၁၁၄": "ယုံကြည်သူတိုင်း",
//     "၁၁၅": "လက်ချည်းဖြင့်သာသွားရလော",
//     "၁၁၆": "လမ်းပြတော်မူ",
//     "၁၁၇": "ခေါ်တော်မူနေသည်",
//     "၁၁၈": "ပလ္လင်တော်စွန့်ခြင်း",
//     "၁၁၉": "ညနေဆုတောင်းသံ",
//     "၁၂၀": "ပြစ်လွတ်ငြိမ်သက်တန်ခိုး",
//     "၁၂၁": "အရှင်ဘုရားကိုယ်တော်အပါး",
//     "၁၂၂": "နေ့အချိန်ကုန်လုပြီ",
//     "၁၂၃": "လုံးလုံးယုံကြည်လျက်",
//     "၁၂၄": "ဗက်လင်မြို့သို့ကြွလာတော်မူ",
//     "၁၂၅": "ငါ့ဝိညာဉ်တုန်လှုပ်မှုအားလုံး",
//     "၁၂၆": "ပို့ဆောင်မူပါ",
//     "၁၂၇": "လွန်မသွားနှင့်",
//     "၁၂၈": "ဘုန်းတော်ြမတ်",
//     "၁၂၉": "ယေရှုနာမတော်",
//     "၁၃၀": "ပြစ်ထက်ကြီးလှကျေးဇူးတော်",
//     "၁၃၁": "သခင်ယေရှု၏နာမတော်",
//     "၁၃၂": "မိုးတိမ်များလွင့်သွားသောအခါ",
//     "၁၃၃": "လက်ဝါးကပ်တိုင်",
//     "၁၃၄": "ယေရှုကိုခေါ်ဖိတ်ပါ",
//     "၁၃၅": "သမားတော်ကြီး",
//     "၁၃၆": "မင်္ဂလာရှိအသွေးတော်",
//     "၁၃၇": "လင်းရန်ယေရှုတောင်းခံ",
//     "၁၃၈": "ပျက်စီးလမ်းလွဲသူကိုကယ်တင်ခြင်း",
//     "၁၃၉": "သာ၍မြင့်သောကုန်းမြင့်ပေါ်မှာ",
//     "၁၄၀": "ပြောပြစရာဝတ္ထုရှိသည်",
//     "၁၄၁": "ဖွားတော်မူခြင်း",
//     "၁၄၂": "မှုတော်ဆောင်ရွက်",
//     "၁၄၃": "ငါသည်လမ်းဖြစ်သည်",
//     "၁၄၄": "တိုင်တော်နားမှာ",
//     "၁၄၅": "ဖြူဝတ်လုံကိုဝတ်ဆင်သူ",
//     "၁၄၆": "သန့်ရှင်းသောဝိညာဉ်တော်",
//     "၁၄၇": "ဗက်လင်မြို့ငယ်ကျူး",
//     "၁၄၈": "‌ရှေးဝတ္ထုဟောင်း",
//     "၁၄၉": "ယေရှုထံသို့လာပါ",
//     "၁၅၀": "အနန္တဘုရင်လမ်းပြ",
//     "၁၅၁": "ဆင်းရဲမှုန်တိုင်း",
//     "၁၅၂": "အနန္တတန်ခိုးရှင်ကြွလာ",
//     "၁၅၃": "ဟာလေလုယာမှုပြီးပြီ",
//     "၁၅၄": "သီချင်းသံကြားရသည်",
//     "၁၅၅": "ကျေးဇူးတော်",
//     "၁၅၆": "သက်ရှင်သောကြောင့်",
//     "၁၅၇": "ယေရှုတိုင်တော်",
//     "၁၅၈": "အိမ်ထောင်လုံးနောင်တ",
//     "၁၅၉": "ဘုရား၏မေတ္တာချိုသာ",
//     "၁၆၀": "မညည်းဘဲစောင့်နေ",
//     "၁၆၁": "မင်္ဂလာဆု",
//     "၁၆၂": "ကိုယ်တော်နှင့်တူလျှောက်လှမ်းစေ",
//     "၁၆၃": "မိုးပွင့်ထက်ဖြူစေ",
//     "၁၆၄": "ယေရှုကျွန်ုပ်လာသည်",
//     "၁၆၅": "ခရစ်တော်ကိုချဉ်းကပ်",
//     "၁၆၆": "ယေရှုကြွလာသောအခါ",
//     "၁၆၇": "ယေရှုအကြောင်းအောက်မေ့ခြင်း",
//     "၁၆၈": "မှုန်တိုင်းကျသောအခါကွယ်ကာရာ",
//     "၁၆၉": "ဘိုးဘေးတို့၏ယုံကြည်ခြင်း",
//     "၁၇၀": "မိတ်ဆွေယေရှု",
//     "၁၇၁": "သိုးသူငယ်ကိုကြည့်လော့",
//     "၁၇၂": "တံပိုးခရာမှုတ်ကာ",
//     "၁၇၃": "မေတ္တာတော်",
//     "၁၇၄": "ထာဝရလက်ရုံးပေါ်မှီတွယ်နေ",
//     "၁၇၅": "မြစ်နားမှာစုရုံးကြမည်လား",
//     "၁၇၆": "ယေရှု၏နာမတန်ခိုးကိုချီးမွမ်းလော့",
//     "၁၇၇": "ဝမ်းနည်းသူလာ",
//     "၁၇၈": "မြတ်လှနာမ",
//     "၁၇၉": "မြို့၏ဘုန်းတော်",
//     "၁၈၀": "ရှိသမျှစွန့်ခြင်း",
//     "၁၈၁": "ရွှေမျက်နှာတော်ဖူးမြင်",
//     "၁၈၂": "ယေရှုရင်ခွင်တော်ခိုလှုံ",
//     "၁၈၃": "တိတ်ဆိတ်ညသန့်ရှင်းည",
//     "၁၈၄": "ရှင်ဘုရင်အမှုတော်",
//     "၁၈၅": "ရွှင်လန်းနေ့",
//     "၁၈၆": "ယေရှုကိုပြောရမည်",
//     "၁၈၇": "ယေရှုရှင်ခေါ်နေ",
//     "၁၈၈": "လောကစည်းစိမ်များ",
//     "၁၈၉": "ဟာလေလုယာကယ်တင်ပိုင်ရှင်",
//     "၁၉၀": "ယေရှုထူမခဲ့ပြီ",
//     "၁၉၁": "ကယ်တင်ရှင်ထံချဉ်းကပ်ပါ",
//     "၁၉၂": "ယေရှုနင့်ဘယ်အရပ်သို့မဆို",
//     "၁၉၃": "ယေရှုရှင်ကယ်တင်သည်",
//     "၁၉၄": "ယုံကြည်ခြင်းသည်အောင်မြင်ခြင်း",
//     "၁၉၅": "သံသရာလှေပဲ့တော်မူပါ",
//     "၁၉၆": "ယေရှုရှင်ကိုယ်တော်ကိုချစ်ပါ၏",
//     "၁၉၇": "ယေရှုရှင်ငါ့ဖို့စိတ်ချစရာ",
//     "၁၉၈": "ယေရှုအပြစ်သားကိုလက်ခံ",
//     "၁၉၉": "ခမည်းတော်၏မီးပြတိုက်",
//     "၂၀၀": "ယုံကြည်အားကိုးခြင်း",
//     "၂၀၁":"လာကြပါတပည့်တော်များ",
//     "၂၀၂":"ယေရှုငါ့စိတ်တွင်ကိန်းစဉ်",
//     "၂၀၃":"ထာဝရဘုရားအစဉ်ခိုလုံရာဖြစ်၏",
//     "၂၀၄":"လာချင်သူတိုင်းလာနိုင်ခြင်း",
//     "၂၀၅":"အံ့သြဖွယ်လက်ဝါးကပ်တိုင်တော်ကြည့် ၁",
//     "၂၀၆":"အံ့သြဖွယ်လက်ဝါးကပ်တိုင်တော်ကြည့် ၂",
//     "၂၀၇":"လက်ဝါးကပ်တိုင်ရိုက်နှက်ခံ",
//     "၂၀၈":"ယေရှုရှင်ဖို့သက်ရှင်",
//     "၂၀၉":"တပည့်တော်အချင်းချင်းချစ်ခြင်း",
//     "၂၁၀":"လမ်းတစ်လျှောက်လုံး",
//     "၂၁၁":"လှိုင်းနက်တစ်ဖက်သို့ပစ်ချ",
//     "၂၁၂":"ဟာလေလုယာ ရှင်လာလိမ့်မည်",
//     "၂၁၃":"သန့်ရှင်းဝိညာဉ်နှင့်တူ",
//     "၂၁၄":"‌လောကအလင်း",
//     "၂၁၅":"သခင်ဘုရားနေ့အတွက်အားရခြင်း",
//     "၂၁၆":"မေတ္တာဝတ္ထုပြောကြားလို",
//     "၂၁၇":"ယေရှုပေးဆပ်ခဲ့ပြီ",
//     "၂၁၈":"သာယာပြည်တော်",
//     "၂၁၉":"သာယာသောနောင်ကာလ",
//     "၂၂၀":"သာ၍နီးစေပါ",
//     "၂၂၁":"သစ္စာနှင့်စောင့်နေ",
//     "၂၂၂":"ဝေးလှသောတောင်ကုံးပေါ်",
//     "၂၂၃":"ယေရှုနောက်သို့လိုက်ခြင်း",
//     "၂၂၄":"သင်ဘို့ငါအသက်ပေး",
//     "၂၂၅":"သန့်ရှင်းတော်မူခြင်း",
//     "၂၂၆":"ကျွန်ုပ်မနက်ဖြန်ပိုင်သူကိုသိ",
//     "၂၂၇":"ပြည့်စုံမေတ္တာ",
//     "၂၂၈":"သွေးတော်ဖြင့်ဆေးကြောခံပြီလား",
//     "၂၂၉":"သွေးတော်မြတ်၌တန်ခိုးရှိသည်",
//     "၂၃၀":"ဇိအုန်မြင့်ပေ",
//     "၂၃၁":"ဥယာဉ်သို့ငါတစ်ဦးတည်းလာ",
//     "၂၃၂":"ထက်ကောင်းကင်သို့‌ရောက်လာသောအခါ",
//     "၂၃၃":"ဖြူစင်စိတ်ကြည်နူး",
//     "၂၃၄":"အစဉ်ဖို့တစ်ခါ",
//     "၂၃၅":"အစေခံမှု",
//     "၂၃၆":"ချိုင့်ဝမ်းမှ နှင်းပန်း",
//     "၂၃၇":"မြေကြီးပြင်၏ သင့်တယ်ခြင်း",
//     "၂၃၈":"အပြစ်သားမျှသာ",
//     "၂၃၉":"အလင်း၌အခြေချခြင်း",
//     "၂၄၀":"ယေရှု၌အောင်မြင်ခြင်း",
//     "၂၄၁":"သခင်ဘုရား၏နေ့",
//     "၂၄၂":"အလင်းရောင်",
//     "၂၄၃":"အသင်း‌တော်၏အမြစ်",
//     "၂၄၄":"ကျွန်ုပ်‌လောကဧည့်သည်",
//     "၂၄၅":"မြဲတည်ကျောက်",
//     "၂၄၆":"အံ့ဖွယ်သက်ရှင်စကား",
//     "၂၄၇":"အံ့ဖွယ်ငြိမ်သက်ခြင်း",
//     "၂၄၈":"ဥပဇ္စျယ်ကြွလာပြီ",
//     "၂၄၉":"ကျွန်ုပ်တို့ကိုချစ်‌သော ကိုယ်တော်ရှင်",
//     "၂၅၀":"အိမ်ထောင်မှာမေတ္တာ",
//     "၂၅၁":"ယေရှုငါ့ကိုချစ်ခြင်း",
//     "၂၅၂":"ကျွန်ုပ်သာယော်ဒန်မြစ် မကူးသာ",
//     "၂၅၃":"ပို့ဆောင်ပါ",
//     "၂၅၄":"အလင်းကိုလွတ်လိုက်ပါ",
//     "၂၅၅":"သခင်၏ကျေးဇူးတော်",
//     "၂၅၆":"ကျွန်ုပ်ဝိညာဉ်၌ ဘုန်းတော်ရှိ",
//     "၂၅၇":"ကားတိုင်တံစွန်တော်",
//     "၂၅၈":"အိုသန့်ရှင်းည",
//     "၂၅၉":"သန့်ရှင်းဘုရားကျမ်းစာ",
//     "၂၆၀":"ကောင်းကင်ဘုံအလင်း",
//     "၂၆၁":"သူဘာလုပ်ခဲ့သလဲ",
//     "၂၆၂":"အံ့ဖွယ်ဝတ္ထုကျွန်ုပ်ကျူးဧမည်",
//     "၂၆၃":"အသင်းတော်ကိုချစ်ခြင်း",
//     "၂၆၄":"စွန့်ပစ်၍မထား",
//     "၂၆၅":"နံနက်ယံသီချင်း",
//     "၂၆၆":"ထက်ရပ်မှာညမရှိ",
//     "၂၆၇":"ယေရှုလက်ဝါးကားတိုင်အောက်",
//     "၂၆၈":"ခရစ်တော်လူ့ဇာတိခံယူလာ",
//     "၂၆၉":"သွေးတော်နှင့်ပြည့်သောစမ်း",
//     "၂၇၀":"ယေရှုကျွန်ုပ်အံ့ဖွယ်ကယ်ချွတ်ရှင်",
//     "၂၇၁":"သူ‌ခေါ်ရာနောက်လိုက်မည်",
//     "၂၇၂":"ရှိသမျှမှုတော်ပလ္လင်ထက်တင်ပြီလား",
//     "၂၇၃":"ကျွန်ုပ်အသက်လက်ခံပါ",
//     "၂၇၄":"ယေရှုရှင်၏ဝတ္ထုပြောပါ",
//     "၂၇၅":"ကျောက်‌ဆူးရှိပေ",
//     "၂၇၆":"ချစ်ခြင်းမေတ္တာကြီးမြတ်ကျူး",
//     "၂၇၇":"ခိုင်မာကျောက်ဆောင်အရိပ်၌",
//     "၂၇၈":"နောက်သို့လိုက်",
//     "၂၇၉":"ယေရှုကြွသည့်တိုင်လုပ်ဆောင်",
//     "၂၈၀":"ရွေးနုတ်ရှင်ကိုချီးမွမ်းမည်",
//     "၂၈၁":"ကိုယ်တော်၏မျက်မှောက်တော်၌",
//     "၂၈၂":"စဉ်မြဲသောတည်ရှိနေ",
//     "၂၈၃":"ဂုဏ်တော်ကိုချီးမွမ်းဖို့စုရုံး",
//     "၂၈၄":"ယေရှုနှင့်အတူ လျှောက်လမ်းခြင်း",
//     "၂၈၅":"ထောမနာများ",
//     "၂၈၆":"နှုတ်ကပတ်တော်",
//     "၂၈၇":"ယေရှုနာမတော်ချိုသာလှကျူး",
//     "၂၈၈":"ငါ့ထံသို့လာ",
//     "၂၈၉":"ကယ်တင်ရှင်ကိုအပ်နှံသည့်ည",
//     "၂၉၀":"သက်ရှင်ခြင်းကျူး",
//     "၂၉၁":"မင်္ဂလာဆောင်ပွဲကျူး",
//     "၂၉၂":"ကိုယ်တော်တစ်နေ့ပြန်လာမည်",
//     "၂၉၃":"ယေရှုကိုကိုးစားခြင်းလွန်သာချို",
//     "၂၉၄":"စင်ကြယ်သောစမ်းရေ",
//     "၂၉၅":"ကိုယ်တော်ရှင်၏ချစ်မေတ္တာတော်",
//     "၂၉၆":"သန့်ရှင်းဖို့ကြိုးစားပါကျူး",
//     "၂၉၇":"ယေရှုအတွက်သာ",
//     "၂၉၈":"ချစ်သနားယေရှုဘုရား",
//     "၂၉၉":"နေထွက်ရပ်တံခါးမုခ်",
//     "၃၀၀":"ပျောက်သူများရှာ",
//     "၃၀၁":"ခိုလုံရာရပ်",
//     "၃၀၂":"စိတ်နှလုံးဆက်မနည်းစေ",
//     "၃၀၃":"အလိုတော်ရှိရာပြုတော်မူပါ",
//     "၃၀၄":"မြေကြီးစွန်းအရပ်",
//     "၃၀၅":"ကယ်တင်နိုင်စွမ်းသောထာဝရအဘ",
//     "၃၀၆":"ကျေးဇူးရှင်ဂရုဏာ",
//   };

//   late Map<String, String> filteredHymns;

//   @override
//   void initState() {
//     super.initState();
//     filteredHymns = hymns;
//     _searchController.addListener(_filterHymns);
//   }

//   @override
//   void dispose() {
//     _searchController.dispose();
//     super.dispose();
//   }

//    void _filterHymns() {
//     final query = _searchController.text.trim().toLowerCase();
//     if (query.isEmpty) {
//       setState(() {
//         filteredHymns = hymns;
//       });
//     } else {
//       final filtered = Map.fromEntries(hymns.entries.where((entry) {
//         final keyMatch = entry.key.contains(query);
//         final valueMatch = entry.value.toLowerCase().contains(query);
//         final indexMatch = (hymns.keys.toList().indexOf(entry.key)+1).toString().contains(query);
//         return keyMatch || valueMatch || indexMatch;
//       }));

//       setState(() {
//         filteredHymns = filtered;
//       });
//     }
//   }

//   void _showGridDialog(BuildContext context) {
//     showDialog(
//       context: context,
//       builder: (BuildContext context) {
//         return Dialog(
//           child: Container(
//             color: Colors.white,
//             width: MediaQuery.of(context).size.width * 0.8,
//             padding: EdgeInsets.all(5),
//             child: Column(
//               children: [
//                 SizedBox(
//                   height: 10,
//                 ),
//                 Text(
//                   'ဓမ္မသီချင်းနံပါတ်များ',
//                   style: TextStyle(fontWeight: FontWeight.bold),
//                 ),
//                 SizedBox(height: 10),
//                 Expanded(
//                   child: GridView.builder(
//                     gridDelegate: SliverGridDelegateWithFixedCrossAxisCount(
//                       crossAxisCount: 7,
//                       crossAxisSpacing: 7,
//                       mainAxisSpacing: 7,
//                     ),
//                     itemCount: 306,
//                     itemBuilder: (BuildContext context, int index) {
//                       final hymnKey = hymns.keys.elementAt(index);

//                       return GestureDetector(
//                         onTap: () async {

//                           Navigator.push(
//                             context,
//                             MaterialPageRoute(
//                               builder: (context) => MyPdfViewer(
//                                 pdfPath: 'asset/images/MH${(index + 1).toString().padLeft(3,'0')}-1.jpg',
//                                 number: hymnKey,
//                                 hymn: hymns.values.elementAt(index),
//                                 type: "ဓမ္မသီချင်း",
//                                 index: index + 1,
//                               ),
//                             ),
//                           );
//                         },
//                         child: Container(
//                           decoration: BoxDecoration(
//                             color: Colors.blueAccent,
//                             borderRadius: BorderRadius.circular(3),
//                           ),
//                           child: Center(
//                             child: Text(
//                               hymnKey,
//                               style: TextStyle(
//                                 color: Colors.white,
//                                 fontWeight: FontWeight.bold,
//                               ),
//                             ),
//                           ),
//                         ),
//                       );
//                     },
//                   ),
//                 ),
//               ],
//             ),
//           ),
//         );
//       },
//     );
//   }

//   @override
//   Widget build(BuildContext context) {
//     return Scaffold(
//       backgroundColor:
//           Provider.of<ThemeProvider>(context).themeData.colorScheme.secondary,
//       body: Column(
//         crossAxisAlignment: CrossAxisAlignment.stretch,
//         children: [
//           SizedBox(
//             height: 20,
//           ),
//           Row(
//             children: [
//               SizedBox(
//                 width: 20,
//               ),
//               Expanded(
//                 child: CupertinoSearchTextField(
//                   decoration: BoxDecoration(
//                     color: CupertinoColors.systemGrey5,
//                     borderRadius: BorderRadius.circular(20),
//                   ),
//                   controller: _searchController,
//                   placeholder: 'ဓမ္မသီချင်း နံပါတ်ရိုက်ရှာရန်',
//                   style: TextStyle(fontSize: 16),
//                   placeholderStyle: TextStyle(
//                     color: Color.fromARGB(255, 112, 111, 111),
//                     fontSize: 15,
//                   ),
//                   prefixInsets: EdgeInsets.only(left: 16),
//                 ),
//               ),
//               SizedBox(
//                 width: 20,
//               ),
//               IconButton(
//                 icon: Image.asset(
//                   'asset/icons/grid2.png',
//                   color: Provider.of<ThemeProvider>(context)
//                       .themeData
//                       .colorScheme
//                       .inversePrimary,
//                   height: 18,
//                 ),
//                 onPressed: () {
//                   _showGridDialog(context);
//                 },
//               ),
//             ],
//           ),
//           Expanded(
//             child: ListView.builder(
//               itemCount: filteredHymns.length,
//               itemBuilder: (context, index) {
//                 final hymnKey = filteredHymns.keys.elementAt(index);
//                 final hymnValue = filteredHymns[hymnKey]!;
//                 return _buildPDFViewer(hymnKey, hymnValue, index + 1);
//               },
//             ),
//           ),
//         ],
//       ),
//     );
//   }

//   Widget _buildPDFViewer(String key, String hymn, int index) {
//     return InkWell(
//       onTap: () async {

//         Navigator.push(
//           context,
//           MaterialPageRoute(
//             builder: (context) => MyPdfViewer(
//               pdfPath: 'asset/images/MH${index.toString().padLeft(3,'0')}-1.jpg',
//               number: key,
//               hymn: hymn,
//               type: "ဓမ္မသီချင်း",
//               index: index,
//             ),
//           ),
//         );
//       },
//       child: Padding(
//         padding: const EdgeInsets.only(left: 10),
//         child: ListTile(
//           leading: Text(
//             '$key   -',
//             style: TextStyle(
//               fontSize: 15,
//               color: Provider.of<ThemeProvider>(context)
//                   .themeData
//                   .colorScheme
//                   .inversePrimary,
//             ),
//           ),
//           title: Text(
//             hymn,
//             style: TextStyle(
//               color: Provider.of<ThemeProvider>(context)
//                   .themeData
//                   .colorScheme
//                   .inversePrimary,
//             ),
//           ),
//         ),
//       ),
//     );
//   }
// }
import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:hymn/screens/hymn_pdf.dart';
import 'package:hymn/themes/theme_provider.dart';
import 'package:provider/provider.dart';

class HomePage extends StatefulWidget {
  const HomePage({super.key});

  @override
  State<HomePage> createState() => _HomePageState();
}

class _HomePageState extends State<HomePage> {
  final TextEditingController _searchController = TextEditingController();

  bool isHovered = false;
  bool isTapped = false;

  Color defaultColor = Colors.blueGrey;
  Color hoveredColor = Colors.blue;
  Color tappedColor = Colors.green;
  final Map<String, String> hymns = {
    "၁": "ခမည်းတော်ကမ္ဘာ",
    "၂": "ဘုရားသခင်အားဘုန်းကြီးစေသော",
    "၃": "ထက်ဘုံတော်မှကောင်းကင်သားများ",
    "၄": "ဘုရားသခင်မေတ္တာ",
    "၅": "အပ္ပမေယျမေတ္တာတော်",
    "၆": "ထာဝရဘုရားသည်မေတ္တောတော်ရှင်",
    "၇": "အားကြီးသောခံတပ်",
    "၈": "မင်္ဂလာရှိနာမတော်",
    "၉": "ကြီးမားလှသစ္စာ",
    "၁၀": "ဘယ်မျှကြီးမြတ်တော်မူသည်",
    "၁၁": "ယေရှု၏အံ့ဩဖွယ်ကျေးဇူးတော်",
    "၁၂": "ကတိတော်၌တည်",
    "၁၃": "အံ့ဘွယ်ကျေးဇူးတော်",
    "၁၄": "ကရာနီမှာ",
    "၁၅": "ကားတိုင်မှာ",
    "၁၆": "ကားတိုင်လမ်း",
    "၁၇": "ကယ်တင်ခြင်းစိတ်ချ၍ချီးမွမ်း",
    "၁၈": "ကယ်တင်ပိုင်ရှင်ဝင်ပါစေ",
    "၁၉": "ကယ်တင်ရှင်သိုးထိန်းလမ်းပြ",
    "၂၀": "ကျွန်ုပ်ရွေးနှုတ်သက်ရှင်ပြီ",
    "၂၁": "ဘုန်းတော်ရှင် ဘုရင်",
    "၂၂": "လောကဝမ်းမြောက်စေ",
    "၂၃": "ကိုးစား၍နားထောင်",
    "၂၄": "ကောင်းကင်ခေါင်းလောင်း",
    "၂၅": "ကြည်လင်လှစွာသန်းခေါင်ယံ",
    "၂၆": "ကောင်းချီးရေတွက်",
    "၂၇": "ကရာနီကုန်းပေါ်သွန်း",
    "၂၈": "မုန်တိုင်းလွန်သွားသည့်တိုင်",
    "၂၉": "မုန်တိုင်းထန်ယော်ဒန်ကမ်း ၁",
    "၃၀": "မုန်တိုင်းထန်ယော်ဒန်ကမ်း ၂",
    "၃၁": "ချီးမွမ်းကြပါ၏",
    "၃၂": "ကိုယ်တော်ကိုချီးမွမ်းကြလော့",
    "၃၃": "ကောင်းမြတ်သခင်",
    "၃၄": "အကောင်းဆုံးမိတ်ဆွေ",
    "၃၅": "ဆုတောင်းရန်နာရီ",
    "၃၆": "ကောင်းပေသည်",
    "၃၇": "ကိုယ်တော်ကိုချီးမွမ်းမည်",
    "၃၈": "ကိုယ်တော်ကိုသာ၍ချစ်ကြောင်းသိသည်",
    "၃၉": "ကိုယ်တော်ကိုသာ၍ချစ်ခြင်း",
    "၄၀": "ကိုယ်တော်ကိုသိလိမ့်မည်",
    "၄၁": "ဆာငတ်မွတ်သိပ်မှုပျောက်စေရန်",
    "၄၂": "ကိုယ်တော်အလိုအတိုင်း",
    "၄၃": "ကိုယ်တော်၌သာ ကွယ်ကာနေပါ",
    "၄၄": "ကိုယ်တော်အားအကောင်းဆုံးကိုပေးပါ",
    "၄၅": "ကိုယ်တော်ကိုလိုပါ၏",
    "၄၆": "ကိုယ်တော်၌ဝမ်းမြောက်လော့",
    "၄၇": "ကိုယ်တော်နှင့်နီးစေပါ",
    "၄၈": "ကိုယ်တော်ထံမှသတင်းရှိ",
    "၄၉": "စောင့်ထိန်းတော်မူလိမ့်မည်",
    "၅၀": "ကိုယ်တော်သက်ရှင်",
    "၅၁": "ကိုယ်တော်ကျိန်းရန်မရှိ",
    "၅၂": "ကိုယ်တော်နှင့်အတူရှိပါစေသော",
    "၅၃": "နိုင်ငံတော်တည်ခြင်း",
    "၅၄": "ကိုယ်တော်လိုချိန်",
    "၅၅": "စိတ်ငယ်ဝမ်းနည်းဒုက္ခကြီးထဲမှာ",
    "၅၆": "ကောက်လိုင်းများဆောင်ယူခြင်း",
    "၅၇": "ညအမှောင်ရောက်လုပြီ",
    "၅၈": "ညဉ့်ဦးအချိန်",
    "၅၉": "ကျမ်းစာမြတ်ပေးပါ",
    "၆၀": "ကောင်းကင်မြေကြီးသခင်",
    "၆၁": "ဂုဏ်တော်ချီးမွမ်း",
    "၆၂": "ကျွန်ုပ်စိတ်တံခါးဖွင့်ပေးပါ",
    "၆၃": "နေဝင်နောက်ကွယ်",
    "၆၄": "ကိုယ်တော်ဘက်၌မည်သူရှိသနည်း",
    "၆၅": "သိုးထိန်းများစောင့်နေစဉ်",
    "၆၆": "ကျွန်ုပ်မိတ်ဆွေတွေ့ပြီ",
    "၆၇": "ခံတပ်ထိန်းထား",
    "၆၈": "ကျွန်ုပ်သူ့ကိုသိ၏",
    "၆၉": "ပြန်လာပြီသခင်",
    "၇၀": "အဝေးခရီးတလျှောက်",
    "၇၁": "သက်စမ်းရေသိုလာ",
    "၇၂": "ကြီးသောနေ့ရောက်မည်",
    "၇၃": "ကြည့်မြင်၍ သက်ရှင်လေ",
    "၇၄": "ခရစ်တော်ကိုပြောပါ",
    "၇၅": "ခရစ်တော်ထမြောက်ပြီ",
    "၇၆": "ခရစ်တော်၌အရှေ့အနောက်မရှိ",
    "၇၇": "ဘဏ္ဍာတော်",
    "၇၈": "ခရစ်ယာန်စစ်သည်တိုချီ",
    "၇၉": "မင်္ဂလာမိုးသွန်းလောင်းရွာမည်",
    "၈၀": "ငါ၏နာမည်ရေးလျက်ရှိသလား",
    "၈၁": "ရှိသည်အတိုင်းယူပါ",
    "၈၂": "ထက်ရပ်မှာ",
    "၈၃": "အသက်မှုန့်ပေးပါဘုရား",
    "၈၄": "ခရစ်ယာန်ရောက်ရာ",
    "၈၅": "ဂရုဏာထာဝစဉ်တည်",
    "၈၆": "သက်စမ်းရေလမ်း",
    "၈၇": "ရှေးခါဒါဝိဒ်မင်းမြိုတော်မှာ",
    "၈၈": "ငါ့ဝိညာဉ်၌အလင်းရှိ",
    "၈၉": "ယနေ့ခရစ်တော်ထမြောက်ပြီ",
    "၉၀": "ထိုနေရာ၌ကြယ်များရှိဦးမည်လော",
    "၉၁": "မျှော်လင့်ခြင်းတည်ရာကျောက်",
    "၉၂": "ယေရှုကိုယုံကြည်ခြင်း",
    "၉၃": "ယေရှုထံလာပြီ",
    "၉၄": "စစ်တိုက်သံကြွေးကြော်",
    "၉၅": "ယေရှုဖိုထကြ",
    "၉၆": "နာမည်ခေါ်သောခါ",
    "၉၇": "ပြည့်စုံသောငြိမ်သက်ခြင်း",
    "၉၈": "ဆုတောင်းရန်အချိန်ကျပြီ",
    "၉၉": "ယေရှုဖိုနေရာအခန်းရှိသလား",
    "၁၀၀": "ဇိအုန်တောင်သို့ချီတက်စို",
    "၁၀၁": "သူငယ်တော်ကား",
    "၁၀၂": "ယေရှုသာလျှင်အလိုဖြည့်နိင်",
    "၁၀၃": "ယေရှုအကြောင်းပို၍သိလို",
    "၁၀၄": "တရားနေမင်း",
    "၁၀၅": "ယေရှုအသွေးတော်",
    "၁၀၆": "ယုံကြည်ခြင်းပငှာနာ",
    "၁၀၇": "တန်ခိုးရှင်အားချီးမ္မမ်းကြလော့",
    "၁၀၈": "နာမတော်ဘုန်းကြီးစေသား",
    "၁၀၉": "ယုံကြည်ပါ",
    "၁၁၀": "နောက်တော်သို့လိုက်ခြင်း",
    "၁၁၁": "ကျွန်ုပ်ယုံပြီ",
    "၁၁၂": "ကောင်းကင်သားကြွေးကြော်သံနားထောင်",
    "၁၁၃": "ထိန်းမြားမင်္ဂလာသီချင်း",
    "၁၁၄": "ယုံကြည်သူတိုင်း",
    "၁၁၅": "လက်ချည်းဖြင့်သာသွားရလော",
    "၁၁၆": "လမ်းပြတော်မူ",
    "၁၁၇": "ခေါ်တော်မူနေသည်",
    "၁၁၈": "ပလ္လင်တော်စွန့်ခြင်း",
    "၁၁၉": "ညနေဆုတောင်းသံ",
    "၁၂၀": "ပြစ်လွတ်ငြိမ်သက်တန်ခိုး",
    "၁၂၁": "အရှင်ဘုရားကိုယ်တော်အပါး",
    "၁၂၂": "နေ့အချိန်ကုန်လုပြီ",
    "၁၂၃": "လုံးလုံးယုံကြည်လျက်",
    "၁၂၄": "ဗက်လင်မြို့သို့ကြွလာတော်မူ",
    "၁၂၅": "ငါ့ဝိညာဉ်တုန်လှုပ်မှုအားလုံး",
    "၁၂၆": "ပို့ဆောင်မူပါ",
    "၁၂၇": "လွန်မသွားနှင့်",
    "၁၂၈": "ဘုန်းတော်ြမတ်",
    "၁၂၉": "ယေရှုနာမတော်",
    "၁၃၀": "ပြစ်ထက်ကြီးလှကျေးဇူးတော်",
    "၁၃၁": "သခင်ယေရှု၏နာမတော်",
    "၁၃၂": "မိုးတိမ်များလွင့်သွားသောအခါ",
    "၁၃၃": "လက်ဝါးကပ်တိုင်",
    "၁၃၄": "ယေရှုကိုခေါ်ဖိတ်ပါ",
    "၁၃၅": "သမားတော်ကြီး",
    "၁၃၆": "မင်္ဂလာရှိအသွေးတော်",
    "၁၃၇": "လင်းရန်ယေရှုတောင်းခံ",
    "၁၃၈": "ပျက်စီးလမ်းလွဲသူကိုကယ်တင်ခြင်း",
    "၁၃၉": "သာ၍မြင့်သောကုန်းမြင့်ပေါ်မှာ",
    "၁၄၀": "ပြောပြစရာဝတ္ထုရှိသည်",
    "၁၄၁": "ဖွားတော်မူခြင်း",
    "၁၄၂": "မှုတော်ဆောင်ရွက်",
    "၁၄၃": "ငါသည်လမ်းဖြစ်သည်",
    "၁၄၄": "တိုင်တော်နားမှာ",
    "၁၄၅": "ဖြူဝတ်လုံကိုဝတ်ဆင်သူ",
    "၁၄၆": "သန့်ရှင်းသောဝိညာဉ်တော်",
    "၁၄၇": "ဗက်လင်မြို့ငယ်ကျူး",
    "၁၄၈": "‌ရှေးဝတ္ထုဟောင်း",
    "၁၄၉": "ယေရှုထံသို့လာပါ",
    "၁၅၀": "အနန္တဘုရင်လမ်းပြ",
    "၁၅၁": "ဆင်းရဲမှုန်တိုင်း",
    "၁၅၂": "အနန္တတန်ခိုးရှင်ကြွလာ",
    "၁၅၃": "ဟာလေလုယာမှုပြီးပြီ",
    "၁၅၄": "သီချင်းသံကြားရသည်",
    "၁၅၅": "ကျေးဇူးတော်",
    "၁၅၆": "သက်ရှင်သောကြောင့်",
    "၁၅၇": "ယေရှုတိုင်တော်",
    "၁၅၈": "အိမ်ထောင်လုံးနောင်တ",
    "၁၅၉": "ဘုရား၏မေတ္တာချိုသာ",
    "၁၆၀": "မညည်းဘဲစောင့်နေ",
    "၁၆၁": "မင်္ဂလာဆု",
    "၁၆၂": "ကိုယ်တော်နှင့်တူလျှောက်လှမ်းစေ",
    "၁၆၃": "မိုးပွင့်ထက်ဖြူစေ",
    "၁၆၄": "ယေရှုကျွန်ုပ်လာသည်",
    "၁၆၅": "ခရစ်တော်ကိုချဉ်းကပ်",
    "၁၆၆": "ယေရှုကြွလာသောအခါ",
    "၁၆၇": "ယေရှုအကြောင်းအောက်မေ့ခြင်း",
    "၁၆၈": "မှုန်တိုင်းကျသောအခါကွယ်ကာရာ",
    "၁၆၉": "ဘိုးဘေးတို့၏ယုံကြည်ခြင်း",
    "၁၇၀": "မိတ်ဆွေယေရှု",
    "၁၇၁": "သိုးသူငယ်ကိုကြည့်လော့",
    "၁၇၂": "တံပိုးခရာမှုတ်ကာ",
    "၁၇၃": "မေတ္တာတော်",
    "၁၇၄": "ထာဝရလက်ရုံးပေါ်မှီတွယ်နေ",
    "၁၇၅": "မြစ်နားမှာစုရုံးကြမည်လား",
    "၁၇၆": "ယေရှု၏နာမတန်ခိုးကိုချီးမွမ်းလော့",
    "၁၇၇": "ဝမ်းနည်းသူလာ",
    "၁၇၈": "မြတ်လှနာမ",
    "၁၇၉": "မြို့၏ဘုန်းတော်",
    "၁၈၀": "ရှိသမျှစွန့်ခြင်း",
    "၁၈၁": "ရွှေမျက်နှာတော်ဖူးမြင်",
    "၁၈၂": "ယေရှုရင်ခွင်တော်ခိုလှုံ",
    "၁၈၃": "တိတ်ဆိတ်ညသန့်ရှင်းည",
    "၁၈၄": "ရှင်ဘုရင်အမှုတော်",
    "၁၈၅": "ရွှင်လန်းနေ့",
    "၁၈၆": "ယေရှုကိုပြောရမည်",
    "၁၈၇": "ယေရှုရှင်ခေါ်နေ",
    "၁၈၈": "လောကစည်းစိမ်များ",
    "၁၈၉": "ဟာလေလုယာကယ်တင်ပိုင်ရှင်",
    "၁၉၀": "ယေရှုထူမခဲ့ပြီ",
    "၁၉၁": "ကယ်တင်ရှင်ထံချဉ်းကပ်ပါ",
    "၁၉၂": "ယေရှုနင့်ဘယ်အရပ်သို့မဆို",
    "၁၉၃": "ယေရှုရှင်ကယ်တင်သည်",
    "၁၉၄": "ယုံကြည်ခြင်းသည်အောင်မြင်ခြင်း",
    "၁၉၅": "သံသရာလှေပဲ့တော်မူပါ",
    "၁၉၆": "ယေရှုရှင်ကိုယ်တော်ကိုချစ်ပါ၏",
    "၁၉၇": "ယေရှုရှင်ငါ့ဖို့စိတ်ချစရာ",
    "၁၉၈": "ယေရှုအပြစ်သားကိုလက်ခံ",
    "၁၉၉": "ခမည်းတော်၏မီးပြတိုက်",
    "၂၀၀": "ယုံကြည်အားကိုးခြင်း",
    "၂၀၁": "လာကြပါတပည့်တော်များ",
    "၂၀၂": "ယေရှုငါ့စိတ်တွင်ကိန်းစဉ်",
    "၂၀၃": "ထာဝရဘုရားအစဉ်ခိုလုံရာဖြစ်၏",
    "၂၀၄": "လာချင်သူတိုင်းလာနိုင်ခြင်း",
    "၂၀၅": "အံ့သြဖွယ်လက်ဝါးကပ်တိုင်တော်ကြည့် ၁",
    "၂၀၆": "အံ့သြဖွယ်လက်ဝါးကပ်တိုင်တော်ကြည့် ၂",
    "၂၀၇": "လက်ဝါးကပ်တိုင်ရိုက်နှက်ခံ",
    "၂၀၈": "ယေရှုရှင်ဖို့သက်ရှင်",
    "၂၀၉": "တပည့်တော်အချင်းချင်းချစ်ခြင်း",
    "၂၁၀": "လမ်းတစ်လျှောက်လုံး",
    "၂၁၁": "လှိုင်းနက်တစ်ဖက်သို့ပစ်ချ",
    "၂၁၂": "ဟာလေလုယာ ရှင်လာလိမ့်မည်",
    "၂၁၃": "သန့်ရှင်းဝိညာဉ်နှင့်တူ",
    "၂၁၄": "‌လောကအလင်း",
    "၂၁၅": "သခင်ဘုရားနေ့အတွက်အားရခြင်း",
    "၂၁၆": "မေတ္တာဝတ္ထုပြောကြားလို",
    "၂၁၇": "ယေရှုပေးဆပ်ခဲ့ပြီ",
    "၂၁၈": "သာယာပြည်တော်",
    "၂၁၉": "သာယာသောနောင်ကာလ",
    "၂၂၀": "သာ၍နီးစေပါ",
    "၂၂၁": "သစ္စာနှင့်စောင့်နေ",
    "၂၂၂": "ဝေးလှသောတောင်ကုံးပေါ်",
    "၂၂၃": "ယေရှုနောက်သို့လိုက်ခြင်း",
    "၂၂၄": "သင်ဘို့ငါအသက်ပေး",
    "၂၂၅": "သန့်ရှင်းတော်မူခြင်း",
    "၂၂၆": "ကျွန်ုပ်မနက်ဖြန်ပိုင်သူကိုသိ",
    "၂၂၇": "ပြည့်စုံမေတ္တာ",
    "၂၂၈": "သွေးတော်ဖြင့်ဆေးကြောခံပြီလား",
    "၂၂၉": "သွေးတော်မြတ်၌တန်ခိုးရှိသည်",
    "၂၃၀": "ဇိအုန်မြင့်ပေ",
    "၂၃၁": "ဥယာဉ်သို့ငါတစ်ဦးတည်းလာ",
    "၂၃၂": "ထက်ကောင်းကင်သို့‌ရောက်လာသောအခါ",
    "၂၃၃": "ဖြူစင်စိတ်ကြည်နူး",
    "၂၃၄": "အစဉ်ဖို့တစ်ခါ",
    "၂၃၅": "အစေခံမှု",
    "၂၃၆": "ချိုင့်ဝမ်းမှ နှင်းပန်း",
    "၂၃၇": "မြေကြီးပြင်၏ သင့်တယ်ခြင်း",
    "၂၃၈": "အပြစ်သားမျှသာ",
    "၂၃၉": "အလင်း၌အခြေချခြင်း",
    "၂၄၀": "ယေရှု၌အောင်မြင်ခြင်း",
    "၂၄၁": "သခင်ဘုရား၏နေ့",
    "၂၄၂": "အလင်းရောင်",
    "၂၄၃": "အသင်း‌တော်၏အမြစ်",
    "၂၄၄": "ကျွန်ုပ်‌လောကဧည့်သည်",
    "၂၄၅": "မြဲတည်ကျောက်",
    "၂၄၆": "အံ့ဖွယ်သက်ရှင်စကား",
    "၂၄၇": "အံ့ဖွယ်ငြိမ်သက်ခြင်း",
    "၂၄၈": "ဥပဇ္စျယ်ကြွလာပြီ",
    "၂၄၉": "ကျွန်ုပ်တို့ကိုချစ်‌သော ကိုယ်တော်ရှင်",
    "၂၅၀": "အိမ်ထောင်မှာမေတ္တာ",
    "၂၅၁": "ယေရှုငါ့ကိုချစ်ခြင်း",
    "၂၅၂": "ကျွန်ုပ်သာယော်ဒန်မြစ် မကူးသာ",
    "၂၅၃": "ပို့ဆောင်ပါ",
    "၂၅၄": "အလင်းကိုလွတ်လိုက်ပါ",
    "၂၅၅": "သခင်၏ကျေးဇူးတော်",
    "၂၅၆": "ကျွန်ုပ်ဝိညာဉ်၌ ဘုန်းတော်ရှိ",
    "၂၅၇": "ကားတိုင်တံစွန်တော်",
    "၂၅၈": "အိုသန့်ရှင်းည",
    "၂၅၉": "သန့်ရှင်းဘုရားကျမ်းစာ",
    "၂၆၀": "ကောင်းကင်ဘုံအလင်း",
    "၂၆၁": "သူဘာလုပ်ခဲ့သလဲ",
    "၂၆၂": "အံ့ဖွယ်ဝတ္ထုကျွန်ုပ်ကျူးဧမည်",
    "၂၆၃": "အသင်းတော်ကိုချစ်ခြင်း",
    "၂၆၄": "စွန့်ပစ်၍မထား",
    "၂၆၅": "နံနက်ယံသီချင်း",
    "၂၆၆": "ထက်ရပ်မှာညမရှိ",
    "၂၆၇": "ယေရှုလက်ဝါးကားတိုင်အောက်",
    "၂၆၈": "ခရစ်တော်လူ့ဇာတိခံယူလာ",
    "၂၆၉": "သွေးတော်နှင့်ပြည့်သောစမ်း",
    "၂၇၀": "ယေရှုကျွန်ုပ်အံ့ဖွယ်ကယ်ချွတ်ရှင်",
    "၂၇၁": "သူ‌ခေါ်ရာနောက်လိုက်မည်",
    "၂၇၂": "ရှိသမျှမှုတော်ပလ္လင်ထက်တင်ပြီလား",
    "၂၇၃": "ကျွန်ုပ်အသက်လက်ခံပါ",
    "၂၇၄": "ယေရှုရှင်၏ဝတ္ထုပြောပါ",
    "၂၇၅": "ကျောက်‌ဆူးရှိပေ",
    "၂၇၆": "ချစ်ခြင်းမေတ္တာကြီးမြတ်ကျူး",
    "၂၇၇": "ခိုင်မာကျောက်ဆောင်အရိပ်၌",
    "၂၇၈": "နောက်သို့လိုက်",
    "၂၇၉": "ယေရှုကြွသည့်တိုင်လုပ်ဆောင်",
    "၂၈၀": "ရွေးနုတ်ရှင်ကိုချီးမွမ်းမည်",
    "၂၈၁": "ကိုယ်တော်၏မျက်မှောက်တော်၌",
    "၂၈၂": "စဉ်မြဲသောတည်ရှိနေ",
    "၂၈၃": "ဂုဏ်တော်ကိုချီးမွမ်းဖို့စုရုံး",
    "၂၈၄": "ယေရှုနှင့်အတူ လျှောက်လမ်းခြင်း",
    "၂၈၅": "ထောမနာများ",
    "၂၈၆": "နှုတ်ကပတ်တော်",
    "၂၈၇": "ယေရှုနာမတော်ချိုသာလှကျူး",
    "၂၈၈": "ငါ့ထံသို့လာ",
    "၂၈၉": "ကယ်တင်ရှင်ကိုအပ်နှံသည့်ည",
    "၂၉၀": "သက်ရှင်ခြင်းကျူး",
    "၂၉၁": "မင်္ဂလာဆောင်ပွဲကျူး",
    "၂၉၂": "ကိုယ်တော်တစ်နေ့ပြန်လာမည်",
    "၂၉၃": "ယေရှုကိုကိုးစားခြင်းလွန်သာချို",
    "၂၉၄": "စင်ကြယ်သောစမ်းရေ",
    "၂၉၅": "ကိုယ်တော်ရှင်၏ချစ်မေတ္တာတော်",
    "၂၉၆": "သန့်ရှင်းဖို့ကြိုးစားပါကျူး",
    "၂၉၇": "ယေရှုအတွက်သာ",
    "၂၉၈": "ချစ်သနားယေရှုဘုရား",
    "၂၉၉": "နေထွက်ရပ်တံခါးမုခ်",
    "၃၀၀": "ပျောက်သူများရှာ",
    "၃၀၁": "ခိုလုံရာရပ်",
    "၃၀၂": "စိတ်နှလုံးဆက်မနည်းစေ",
    "၃၀၃": "အလိုတော်ရှိရာပြုတော်မူပါ",
    "၃၀၄": "မြေကြီးစွန်းအရပ်",
    "၃၀၅": "ကယ်တင်နိုင်စွမ်းသောထာဝရအဘ",
    "၃၀၆": "ကျေးဇူးရှင်ဂရုဏာ",
  };

  late Map<String, String> filteredHymns;

  @override
  void initState() {
    super.initState();
    filteredHymns = hymns;
    _searchController.addListener(_filterHymns);
  }

  @override
  void dispose() {
    _searchController.dispose();
    super.dispose();
  }

  void _filterHymns() {
    final query = _searchController.text.trim().toLowerCase();
    if (query.isEmpty) {
      setState(() {
        filteredHymns = hymns;
      });
    } else {
      final filtered = Map.fromEntries(hymns.entries.where((entry) {
        final keyMatch = entry.key.contains(query);
        final valueMatch = entry.value.toLowerCase().contains(query);
        final indexMatch = (hymns.keys.toList().indexOf(entry.key) + 1)
            .toString()
            .contains(query);
        return keyMatch || valueMatch || indexMatch;
      }));

      setState(() {
        filteredHymns = filtered;
      });
    }
  }

  void _showGridDialog(BuildContext context) {
    showDialog(
      context: context,
      builder: (BuildContext context) {
        return Dialog(
          child: Container(
            color: Colors.white,
            width: MediaQuery.of(context).size.width * 0.8,
            padding: EdgeInsets.all(5),
            child: Column(
              children: [
                SizedBox(
                  height: 10,
                ),
                Text(
                  'ဓမ္မသီချင်းနံပါတ်များ',
                  style: TextStyle(fontWeight: FontWeight.bold),
                ),
                SizedBox(height: 10),
                Expanded(
                  child: GridView.builder(
                    gridDelegate: SliverGridDelegateWithFixedCrossAxisCount(
                      crossAxisCount: 6,
                      crossAxisSpacing: 6,
                      mainAxisSpacing: 6,
                    ),
                    itemCount: filteredHymns.length,
                    itemBuilder: (BuildContext context, int index) {
                      final hymnKey = filteredHymns.keys.elementAt(index);
                      final originalIndex =
                          hymns.keys.toList().indexOf(hymnKey) + 1;

                      return GestureDetector(
                        onTap: () async {
                          Navigator.push(
                            context,
                            MaterialPageRoute(
                              builder: (context) => MyPdfViewer(
                                pdfPath:
                                    'asset/images/MH${originalIndex.toString().padLeft(3, '0')}-1.jpg',
                                number: hymnKey,
                                hymn: hymns.values.elementAt(originalIndex - 1),
                                type: "ဓမ္မသီချင်း",
                                index: originalIndex,
                              ),
                            ),
                          );
                        },
                        child: Container(
                          decoration: BoxDecoration(
                            color: Colors.blueAccent,
                            borderRadius: BorderRadius.circular(3),
                          ),
                          child: Center(
                            child: Text(
                              hymnKey,
                              style: TextStyle(
                                color: Colors.white,
                                fontWeight: FontWeight.bold,
                              ),
                            ),
                          ),
                        ),
                      );
                    },
                  ),
                ),
              ],
            ),
          ),
        );
      },
    );
  }

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor:
          Provider.of<ThemeProvider>(context).themeData.colorScheme.secondary,
      body: Column(
        crossAxisAlignment: CrossAxisAlignment.stretch,
        children: [
          SizedBox(
            height: 20,
          ),
          Row(
            children: [
              SizedBox(
                width: 20,
              ),
              Expanded(
                child: CupertinoSearchTextField(
                  decoration: BoxDecoration(
                    color: CupertinoColors.systemGrey5,
                    borderRadius: BorderRadius.circular(20),
                  ),
                  controller: _searchController,
                  placeholder: 'ဓမ္မသီချင်း ရိုက်ရှာရန်',
                  style: TextStyle(fontSize: 16),
                  placeholderStyle: TextStyle(
                    color: Color.fromARGB(255, 112, 111, 111),
                    fontSize: 15,
                  ),
                  prefixInsets: EdgeInsets.only(left: 16),
                ),
              ),
              SizedBox(
                width: 16,
              ),
              IconButton(
                icon: Image.asset(
                  'asset/icons/grid2.png',
                  color: Provider.of<ThemeProvider>(context)
                      .themeData
                      .colorScheme
                      .inversePrimary,
                  height: 18,
                ),
                onPressed: () {
                  _showGridDialog(context);
                },
              ),
              SizedBox(width: 18,)
            ],
          ),
          Expanded(
            child: filteredHymns.isEmpty
                ? Center(
                    child: Text(
                      'သင်၏ရှာဖွေမှု မတွေ့ရှိပါ😢',
                      style: TextStyle(
                        fontSize: 15,
                        color: Provider.of<ThemeProvider>(context)
                            .themeData
                            .colorScheme
                            .inversePrimary,
                      ),
                    ),
                  )
                : ListView.builder(
                    itemCount: filteredHymns.length,
                    itemBuilder: (context, index) {
                      final hymnKey = filteredHymns.keys.elementAt(index);
                      final originalIndex =
                          hymns.keys.toList().indexOf(hymnKey) + 1;
                      final hymnValue = filteredHymns[hymnKey]!;

                      return _buildPDFViewer(hymnKey, hymnValue, originalIndex);
                    },
                  ),
          ),
        ],
      ),
    );
  }

  Widget _buildPDFViewer(String key, String hymn, int index) {
    return InkWell(
      onTap: () async {
        Navigator.push(
          context,
          MaterialPageRoute(
            builder: (context) => MyPdfViewer(
              pdfPath:
                  'asset/images/MH${index.toString().padLeft(3, '0')}-1.jpg',
              number: key,
              hymn: hymn,
              type: "ဓမ္မသီချင်း",
              index: index,
            ),
          ),
        );
      },
      child: Padding(
        padding: const EdgeInsets.only(left: 10),
        child: ListTile(
          leading: Text(
            '$key   -',
            style: TextStyle(
              fontSize: 15,
              color: Provider.of<ThemeProvider>(context)
                  .themeData
                  .colorScheme
                  .inversePrimary,
            ),
          ),
          title: Text(
            hymn,
            style: TextStyle(
              color: Provider.of<ThemeProvider>(context)
                  .themeData
                  .colorScheme
                  .inversePrimary,
            ),
          ),
        ),
      ),
    );
  }
}
